run/RayleighBenardConvection/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];
// internalField  uniform 0.5;

internalField  #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};
    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};
    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};
    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        scalarField T(mesh.nCells(), 0.5);
        forAll(T,i){
            const scalar y = mesh.C()[i][1];
            T[i] = 0.6-0.2*y;
        }
        T.writeEntry("", os);
    #};
};



boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform 1.0;
    }

    ceiling
    {
        type            fixedValue;
        value           uniform 0.0;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
