run/RayleighBenardConvection/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.e-5;

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform 1.e-13;

    }

    ceiling
    {
        type            fixedValue;
        value           uniform 1.e-13;

    }

    fixedWalls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
